export const course = [
  {
    "id": 1,
    "create_time": "2024-01-15T11:01:37.287Z",
    "update_time": "2024-01-18T03:19:43.000Z",
    "status": true,
    "remark": "数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。",
    "name": "数据结构与算法",
    "avatar": "http://app.minkm.api:8080/image/cb24d172a77878a4b736b7b7dd905de7.png",
    "college": {
      "id": 1,
      "create_time": "2024-01-15T10:36:41.223Z",
      "update_time": "2024-01-15T10:36:41.223Z",
      "status": true,
      "remark": "信息工程学院",
      "name": "信息工程学院",
      "code": "xg"
    }
  },
  {
    "id": 2,
    "create_time": "2024-01-15T12:01:10.482Z",
    "update_time": "2024-01-18T03:21:20.000Z",
    "status": true,
    "remark": "本课程旨在使学生能够理解、设计和开发操作系统，以及掌握操作系统的核心概念和原则。学生将学会如何有效地管理计算机硬件资源，支持多任务处理，并提高计算机系统的性能和安全性。",
    "name": "操作系统",
    "avatar": "http://app.minkm.api:8080/image/ec32e03c4a088e2dcafc4bade3a3a5ec.png",
    "college": {
      "id": 1,
      "create_time": "2024-01-15T10:36:41.223Z",
      "update_time": "2024-01-15T10:36:41.223Z",
      "status": true,
      "remark": "信息工程学院",
      "name": "信息工程学院",
      "code": "xg"
    }
  },
  {
    "id": 3,
    "create_time": "2024-01-15T12:07:42.435Z",
    "update_time": "2024-01-18T03:21:45.000Z",
    "status": true,
    "remark": "理学是生物学的一个分支，研究生物体内各种生命过程和功能的机制和调控。这门课程通常涵盖了生物体内各个系统的功能",
    "name": "生理学",
    "avatar": "http://app.minkm.api:8080/image/c76637cc02f6d6d99f99b24308a1114c.png",
    "college": {
      "id": 4,
      "create_time": "2024-01-15T10:37:49.775Z",
      "update_time": "2024-01-15T10:37:49.775Z",
      "status": true,
      "remark": "医学院",
      "name": "医学院",
      "code": "y"
    }
  },
  {
    "id": 8,
    "create_time": "2024-01-15T12:30:30.321Z",
    "update_time": "2024-01-15T12:30:30.321Z",
    "status": true,
    "remark": "《计算机组成原理》是计算机科学与工程专业的核心课程之一，它主要研究计算机系统的基本组成及其工作原理。",
    "name": "计算机组成原理",
    "avatar": "http://app.minkm.api:8080/image/89b5bfd7f0f06e4237587282de83be98.png",
    "college": {
      "id": 1,
      "create_time": "2024-01-15T10:36:41.223Z",
      "update_time": "2024-01-15T10:36:41.223Z",
      "status": true,
      "remark": "信息工程学院",
      "name": "信息工程学院",
      "code": "xg"
    }
  },
  {
    "id": 9,
    "create_time": "2024-01-15T12:33:04.774Z",
    "update_time": "2024-01-15T12:33:04.774Z",
    "status": true,
    "remark": "《计算机网络》课程是计算机科学与工程专业的重要课程之一，它主要专注于计算机网络的原理、结构、技术及其应用。",
    "name": "计算机网络",
    "avatar": "http://app.minkm.api:8080/image/abc0d68f16bdb9c09c7e01811f632031.png",
    "college": {
      "id": 1,
      "create_time": "2024-01-15T10:36:41.223Z",
      "update_time": "2024-01-15T10:36:41.223Z",
      "status": true,
      "remark": "信息工程学院",
      "name": "信息工程学院",
      "code": "xg"
    }
  },
  {
    "id": 10,
    "create_time": "2024-01-15T12:35:37.480Z",
    "update_time": "2024-01-15T12:35:37.480Z",
    "status": true,
    "remark": "《汇编语言》课程是计算机科学和工程专业学生的基础课程之一。这门课程主要讲解汇编语言的基本概念、语法及其在计算机系统中的应用。",
    "name": "汇编语言",
    "avatar": "http://app.minkm.api:8080/image/24d20c5f17289339dbc9ccc74955be3b.png",
    "college": {
      "id": 1,
      "create_time": "2024-01-15T10:36:41.223Z",
      "update_time": "2024-01-15T10:36:41.223Z",
      "status": true,
      "remark": "信息工程学院",
      "name": "信息工程学院",
      "code": "xg"
    }
  },
  {
    "id": 11,
    "create_time": "2024-01-15T12:38:05.307Z",
    "update_time": "2024-01-18T03:22:45.000Z",
    "status": true,
    "remark": "《生物化学》是生物学、医学、化学和相关领域的重要基础课程，它探讨生物体内化学过程和分子结构。",
    "name": "生物化学",
    "avatar": "http://app.minkm.api:8080/image/6391488f75e4c22ccf226ac2c60d018e.png",
    "college": {
      "id": 4,
      "create_time": "2024-01-15T10:37:49.775Z",
      "update_time": "2024-01-15T10:37:49.775Z",
      "status": true,
      "remark": "医学院",
      "name": "医学院",
      "code": "y"
    }
  },
  {
    "id": 12,
    "create_time": "2024-01-15T12:42:34.603Z",
    "update_time": "2024-01-18T03:22:20.000Z",
    "status": true,
    "remark": "《内科学》是医学专业学生的核心课程之一，专注于成人疾病的诊断、治疗和预防。",
    "name": "内科学",
    "avatar": "http://app.minkm.api:8080/image/710ca401a8a3b95c1dd701581836627c.png",
    "college": {
      "id": 4,
      "create_time": "2024-01-15T10:37:49.775Z",
      "update_time": "2024-01-15T10:37:49.775Z",
      "status": true,
      "remark": "医学院",
      "name": "医学院",
      "code": "y"
    }
  },
  {
    "id": 13,
    "create_time": "2024-01-15T12:44:46.507Z",
    "update_time": "2024-01-15T12:44:46.507Z",
    "status": true,
    "remark": "《解剖学》课程是医学和生物学领域的基础课程，关注人体的结构和组织。",
    "name": "解剖学",
    "avatar": "http://app.minkm.api:8080/image/37a715af5007f4b33c2658770b50a983.png",
    "college": {
      "id": 4,
      "create_time": "2024-01-15T10:37:49.775Z",
      "update_time": "2024-01-15T10:37:49.775Z",
      "status": true,
      "remark": "医学院",
      "name": "医学院",
      "code": "y"
    }
  },
  {
    "id": 14,
    "create_time": "2024-01-15T12:46:37.027Z",
    "update_time": "2024-01-15T12:46:37.027Z",
    "status": true,
    "remark": "《政治哲学》是一门探讨政治理论、思想和原则的课程，它是政治学、哲学以及社会科学领域的重要组成部分。",
    "name": "政治哲学",
    "avatar": "http://app.minkm.api:8080/image/329790141c20e97e3b39c401e2a7a63c.png",
    "college": {
      "id": 3,
      "create_time": "2024-01-15T10:37:42.612Z",
      "update_time": "2024-01-15T10:37:42.612Z",
      "status": true,
      "remark": "法学院",
      "name": "法学院",
      "code": "f"
    }
  }
]