import { IUtilTools } from "../screen/Tab/tab.type"

export const CourseDatas = [
  {
    "id": 1,
    "create_time": "2024-01-15T11:01:37.287Z",
    "update_time": "2024-01-18T03:19:43.000Z",
    "status": true,
    "remark": "数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。数据结构与算法是计算机科学的两个核心概念，它们密切相关且在软件开发和计算机理论中扮演着关键角色。",
    "name": "数据结构与算法",
    "avatar": "http://app.minkm.api:8080/image/cb24d172a77878a4b736b7b7dd905de7.png",
    "college": {
      "id": 1,
      "create_time": "2024-01-15T10:36:41.223Z",
      "update_time": "2024-01-15T10:36:41.223Z",
      "status": true,
      "remark": "信息工程学院",
      "name": "信息工程学院",
      "code": "xg"
    }
  }
]


export const UtilToolDatas: IUtilTools[] = [
  {
    url: "http://124.220.176.205:8080/image/5a20e6b155ca8a6d329435818b4b223b.png",
    nav: { type: "tab", url: "CourseScreen" },
    label: "我的课程"
  },
  {
    url: "http://124.220.176.205:8080/image/6111ea5a4a5fa3f722113db6256b11c5.png",
    nav: { type: "tab", url: "CourseScreen" },
    label: "我的消息"
  },
  {
    url: "http://124.220.176.205:8080/image/f74854b094f95217a6f3f3f98ead7fd8.png",
    nav: { type: "tab", url: "CourseScreen" },
    label: "我的签到"
  },
  {
    url: "http://124.220.176.205:8080/image/dce39efbddf779b0a7de40b8677ce865.png",
    nav: { type: "tab", url: "CourseScreen" },
    label: "我的课表"
  },
  {
    url: "http://124.220.176.205:8080/image/fc946b24eed172e37b2fe67664f57431.png",
    nav: { type: "tab", url: "CourseScreen" },
    label: "我的群聊"
  }
];